import pygame
import random
import BoardScreen as BS # 뒷배경 함수 불러오기
from Tile import Tile # 타일 파일에서 타일 클래스 불러오기

pygame.init()

background = pygame.display.set_mode((1500, 1000))
background.fill((255, 255, 255))

BS.BoardScreen(background) # 뒷배경 그리기 함수 실행

# 타일 설정
# 지역 칸 설정
t_북한산성 = Tile("북한산성", 25, (1055, 670), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_성균관 = Tile("성균관", 30, (1055, 545), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_숭례문 = Tile("숭례문", 30, (1055, 420), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_병산서원 = Tile("병산서원", 25, (1055, 300), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_숙정문 = Tile("숙정문", 30, (895, 135), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_종묘 = Tile("종묘", 35, (780, 130), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_해인사 = Tile("해인사", 30, (645, 135), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_돈의문 = Tile("돈의문", 30, (520, 135), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_경회루 = Tile("경회루", 30, (360, 295), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_수원화성 = Tile("수원화성", 25, (355, 420), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_흥인지문 = Tile("흥인지문", 25, (355, 545), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_남한산성 = Tile("남한산성", 25, (355, 670), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_덕수궁 = Tile("덕수궁", 30, (520, 830), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_창경궁 = Tile("창경궁", 30, (645, 830), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_창덕궁 = Tile("창덕궁", 30, (770, 830), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
t_경복궁 = Tile("경복궁", 30, (895, 830), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)), 0)
# 이벤트 칸 설정
et_출도 = Tile("출도", 45, (1030, 800), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)),float("inf"))
et_무주도 = Tile("무주도", 45, (360, 150), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)),float("inf"))
et_학 = Tile("학", 45, (1050, 150), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)),float("inf"))
et_미정 = Tile("미정", 45, (380, 800), (0, 0, 0, 0), ((0, 0), (0, 0), (0, 0), (0, 0)),float("inf"))

# 설정된 타일 리스트
all_local = [et_출도, t_북한산성, t_성균관, t_숭례문, t_병산서원, et_학, t_숙정문, t_종묘, t_해인사, t_돈의문, et_무주도 , t_경회루, t_수원화성, t_흥인지문, t_남한산성, et_미정, t_덕수궁,
             t_창경궁, t_창덕궁, t_경복궁]

# 보드판에 글씨 반복해서 써 넣기
for name in all_local:
    Tile.tile_word(name,background)



done = True
while done:

    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            done = False

    pygame.display.update()


pygame.quit()